Terraform Apply: `success`
<details><summary>Apply Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka]
azurerm_cognitive_account.openai: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka]
azurerm_postgresql_flexible_server.pg: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-cft-openai-arisaka]
azurerm_cognitive_deployment.gpt-4o: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka/deployments/gpt-4o]
azurerm_cognitive_deployment.gpt-35-turbo: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka/deployments/gpt-35-turbo]
azurerm_cognitive_deployment.gpt-4: Refreshing state... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka/deployments/gpt-4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cognitive_account.openai will be updated in-place
  ~ resource "azurerm_cognitive_account" "openai" {
        id                                 = "/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka"
        name                               = "aoai-cft-openai-arisaka"
      ~ tags                               = {
          + "env"       = "dev"
            "owner"     = "ryouta-arisaka"
          - "terraform" = "true" -> null
        }
        # (13 unchanged attributes hidden)
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "acrcftopenaiarisaka"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-cft-openai-arisaka"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "env"   = "dev"
          + "owner" = "ryouta-arisaka"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_postgresql_flexible_server.pg will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pg" {
        id                            = "/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-cft-openai-arisaka"
        name                          = "pg-cft-openai-arisaka"
      ~ tags                          = {
          + "env"       = "dev"
            "owner"     = "ryouta-arisaka"
          - "terraform" = "true" -> null
        }
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka"
        name       = "rg-cft-openai-arisaka"
      ~ tags       = {
          + "env"       = "dev"
            "owner"     = "ryouta-arisaka"
          - "terraform" = "true" -> null
        }
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
azurerm_resource_group.rg: Modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka]
azurerm_resource_group.rg: Modifications complete after 2s [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka]
azurerm_container_registry.acr: Creating...
azurerm_cognitive_account.openai: Modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka]
azurerm_postgresql_flexible_server.pg: Modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-cft-openai-arisaka]
azurerm_container_registry.acr: Still creating... [10s elapsed]
azurerm_cognitive_account.openai: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-...vices/accounts/aoai-cft-openai-arisaka, 10s elapsed]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 10s elapsed]
azurerm_cognitive_account.openai: Modifications complete after 17s [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.CognitiveServices/accounts/aoai-cft-openai-arisaka]
azurerm_container_registry.acr: Still creating... [20s elapsed]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 20s elapsed]
azurerm_container_registry.acr: Creation complete after 29s [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.ContainerRegistry/registries/acrcftopenaiarisaka]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 30s elapsed]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 40s elapsed]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 50s elapsed]
azurerm_postgresql_flexible_server.pg: Still modifying... [id=/subscriptions/2bfaadbe-8130-4171-ace4-.../flexibleServers/pg-cft-openai-arisaka, 1m0s elapsed]
azurerm_postgresql_flexible_server.pg: Modifications complete after 1m3s [id=/subscriptions/2bfaadbe-8130-4171-ace4-38ad0eaf6d8e/resourceGroups/rg-cft-openai-arisaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-cft-openai-arisaka]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 3 changed, 0 destroyed.

```
</details>